const dataArray = [
  [
    {
      date: '1999',
      description:
        '11 августа — полное солнечное затмение, видимое в Европе, Азии и Северной Африке.',
    },
    {
      date: '2000',
      description: '21 января — полное лунное затмение, видимое в Америке, Европе и Африке.',
    },
    {
      date: '2001',
      description:
        '21 июня — кольцеобразное солнечное затмение, видимое в Южной Африке и Индийском океане.',
    },
    {
      date: '2002',
      description:
        '4 декабря — полное солнечное затмение, видимое в южной части Африки и Австралии.',
    },
    {
      date: '2003',
      description: '9 ноября — полное лунное затмение, видимое в Европе, Азии, Африке и Америке.',
    },
    {
      date: '2004',
      description: '14 октября — частное солнечное затмение, видимое в Америке и Тихом океане.',
    },
  ],
  [
    {
      date: '2015',
      description:
        '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
    },
    {
      date: '2016',
      description: '8 марта — солнечное затмение, видимое в Индийском океане и части Индонезии.',
    },
    {
      date: '2017',
      description: '21 августа — полное солнечное затмение, видимое в США, Канаде и Мексике.',
    },
    {
      date: '2018',
      description: '27 июля — полное лунное затмение, видимое в Европе, Азии, Африке и Австралии.',
    },
    {
      date: '2019',
      description: '2 июля — солнечное затмение, видимое в Чили, Аргентине и Южном океане.',
    },
    {
      date: '2020',
      description: '14 декабря — солнечное затмение, видимое в Южной Америке и части Африки.',
    },
  ],
  [
    {
      date: '2025',
      description: '12 апреля — частное солнечное затмение, видимое в Азии и части Европы.',
    },
    {
      date: '2026',
      description: '5 мая — полное лунное затмение, видимое в Австралии, Азии и Тихом океане.',
    },
    {
      date: '2027',
      description: '28 октября — солнечное затмение, видимое в Индийском океане и части Африки.',
    },
    {
      date: '2028',
      description:
        '25 ноября — кольцеобразное солнечное затмение, видимое в Канаде и на северо-востоке США.',
    },
    {
      date: '2029',
      description: '21 июня — полное солнечное затмение, видимое в Южной Америке и части Африки.',
    },
    {
      date: '2030',
      description:
        '15 февраля — солнечное затмение, видимое в Южной Америке и юго-восточной части Атлантики.',
    },
  ],
  // Второй массив
  [
    {
      date: '2031',
      description: '9 марта — полное лунное затмение, видимое в Америке, Европе и Африке.',
    },
    {
      date: '2032',
      description: '23 ноября — солнечное затмение, видимое в Азии и Австралии.',
    },
    {
      date: '2033',
      description: '30 марта — кольцеобразное солнечное затмение, видимое в Индийском океане.',
    },
    {
      date: '2034',
      description:
        '18 сентября — частное солнечное затмение, видимое в Скандинавии и части России.',
    },
    {
      date: '2035',
      description: '3 ноября — полное лунное затмение, видимое в Америке и Европе.',
    },
    {
      date: '2036',
      description: '9 октября — солнечное затмение, видимое в Южной Америке и части Тихого океана.',
    },
  ],
  // Третий массив
  [
    {
      date: '2037',
      description: '6 мая — полное солнечное затмение, видимое в Гренландии, Канаде и части США.',
    },
    {
      date: '2038',
      description:
        '11 августа — солнечное затмение, видимое в Австралии и южной части Индийского океана.',
    },
    {
      date: '2039',
      description:
        '28 октября — кольцеобразное солнечное затмение, видимое в Южной Америке и юго-восточной части Африки.',
    },
    {
      date: '2040',
      description: '16 февраля — полное лунное затмение, видимое в Азии и части Австралии.',
    },
    {
      date: '2041',
      description: '9 января — частное солнечное затмение, видимое в Южной Африке.',
    },
    {
      date: '2042',
      description: '12 июля — полное лунное затмение, видимое в Европе и Азии.',
    },
  ],
  // Четвертый массив
  [
    {
      date: '2043',
      description: '5 мая — солнечное затмение, видимое в Южной Америке.',
    },
    {
      date: '2044',
      description: '2 июня — кольцеобразное солнечное затмение, видимое в части Европы и Азии.',
    },
    {
      date: '2045',
      description: '13 октября — полное солнечное затмение, видимое в США, Канаде и Мексике.',
    },
    {
      date: '2046',
      description: '28 марта — полное лунное затмение, видимое в Азии и Австралии.',
    },
    {
      date: '2047',
      description: '9 ноября — солнечное затмение, видимое в части Тихого океана и Австралии.',
    },
    {
      date: '2048',
      description: '20 июля — кольцеобразное солнечное затмение, видимое в Индийском океане.',
    },
  ],
];

export default dataArray;
